---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationSpecification
source: html/1fa9132e-ec71-1fc8-20ba-123e94aa282b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationSpecification Property

"Specification"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationSpecification { get; }
```